BOT_TOKEN = '5954824642:AAGkzRp3cgB39uaUZ2OP4Q54C14bQEN3xXM'

#DATA
DATA_BASE_MAIN = 'shop_data.db'

#CHATS ID
admin_chat_id = 57831246

### BUTTONS
send_wish_btn = '📜ПОБАЖАННЯ'
order_btn = "✅ОБРАТИ М'ЯСКО"
info_btn = '💬ІНФОРМАЦІЯ'
contacts_btn = "📞КОНТАКТИ"
back_btn = "🔙ПОВЕРНУТИСЬ ДО ГОЛОВНОГО МЕНЮ"

info_meat_btn = "🍖 Інформація про продукцію"
info_maker_btn = "👨🏻‍🍳 Інформація про виробника"
info_deal_btn = "💸 Оплата і доставка"

cart_btn = "🛒КОШИК"
deal_btn = "💚ПЕРЕЙТИ ДО СПЛАТИ"
cart_remove_btn = "🗑ПРИБРАТИ З КОШИКУ"
remove_all_btn = "❌ ВИДАЛИТИ ВСЕ"

standart_tasty_btn = "🍗 Класичнене м'яско"
chernosliv_tasty_btn = "🧆 М'яско зі смаком чернослива"
ginger_tasty_btn = "🍠 М'яско зі смаком імбиру"

prepay_btn = "💳 Повна передплата"
not_prepay_btn = "📦 Наложений платіж"
done_btn = "❎Передплату відправлено"


#INLINE BUTTONS
btn50 = "50"
btn100 = "100"
btn200 = "200"
btn500 = "500"
btn1000 = "1000"
btnown = "_ownweight"

# name_yes_callback = "name_yes"
# name_no_callback = "name_no"
#
# phone_yes_callback = "phone_yes"
# phone_no_callback = "phone_no"

post_info_yes_callback = "post_info_yes"
post_info_no_callback = "post_info_no"

product_info_text = f"""<b>ІЖСОБІ</b> – в’ялене м’яско зі свіжого м’яса, перемолотих спецій та домашніх інгрідієнтів, як то чорнослив або імбир, ну добрe - імбир з ринку. Ми робимо і одразу ж відправляємо продукцію тобі по пошті. Тому м’ясо не пересушене, не пересолене, не розморожене - суцільний кайф. Якщо є відгук або пропозиція, перейди до меню {send_wish_btn}"""

maker_info_text = """Ім'я виробника занадто відоме, щоб його казати. Скажу лише одне: він красень, якого зростив україньский чорнозем та батьки. Сам їсть м’ясо із кожної партії, тому має зайву вагу. Але це все заради вас"""

deal_info_text = "Оплачувати можна <b>на картку.</b> (часткова або повна передплата), при накладному платежі, товар сплачується у відділені поштового оператора. Відправляємо <b>виключно Новою Поштою</b>"

post_info_reask_text = """Тепер напиши, будь ласка, інформацію про відправлення (Місто, область та номер відділання Нової Пошти. Наприклад 'Київ, Київська область, №121')"""